Infineon/cmsis_packs/TLE987x/Infineon.TLE987x_DFP.pdsc
		  <device Dname="TLE9879-2QXA40">
			<processor Dclock="40000000"/>
			<compile header="Device/Include/tle987x.h" define="TLE9879_2QXA40;RTE_DEVICE_BF_STEP"/>
			<debug      svd="SVD/TLE9879_2/TLE987x.svd"/>
			<memory     id="IROM1"                      start="0x11000000"  size="0x1EFFC"     startup="1"   default="1"/>
			<memory     id="IROM2"                      start="0x1101EFFC"  size="0x1004"      startup="0"   default="1"/>
			<memory     id="IRAM1"                      start="0x18000000"  size="0x1800"      init   ="0"   default="1"/>
			<algorithm  name="Flash/TLE9879.FLM"        start="0x11000000"  size="0x1F000"                   default="1"/>
			<algorithm  name="Flash/TLE9879_EEP.FLM"    start="0x1101F000"  size="0x1000"                    default="1"/>
			<book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
			<book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x Series BootROM Manual"/>
			<book    name="Documents/TLE9879-2QXA40-BF-Data-Sheet-10-Infineon.pdf"  title="TLE9879-2QXA40 Data Sheet"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
			<feature type="ADC"           n="1"       m="10"/>
			<feature type="ADC"           n="1"       m="8"/>
			<feature type="ADC"           n="1"       m="14"/>
			<feature type="IOs"           n="11"/>
		  </device>
      </subFamily>
   </family>
  </devices>

  <conditions>                                                                
  <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="ADC">
		<description>IF ADC1 is selected, ADC2 and BDRV must also be selected</description>
		<require Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
		<require Cclass="Device" Cgroup="SDK" Csub="ADC2"/>
		<require condition="TLE987x CMSIS Device"/>
	</condition>
	
	<condition id="Only ConfigWizard">
	<!-- Condition for ConfigWizard_v1.x -->
		<description>If ConfigWizard_v1.x is selected, version 2.x must not be selected</description>
		<deny Cclass="Device" Cgroup="ConfigWizard_v2" Csub=""/>
	</condition>
	
	<condition id="Only ConfigWizard_v2">
	<!-- Condition for ConfigWizard_v2.x -->
		<description>If ConfigWizard_v2.x is selected, version 1.x must not be selected</description>
		<deny Cclass="Device" Cgroup="ConfigWizard" Csub=""/>
	</condition>
	
    <condition id="TLE987x CMSIS Device">                                     
    <!-- conditions selecting Devices -->
      <description>Infineon TLE987x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Cclass="Device" Cgroup="SDK" Csub="SCU"/>
      <require Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
      <require Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ISR"/>
      <require Cclass="Device" Cgroup="SDK" Csub="INT"/>
      <require Cclass="Device" Cgroup="SDK" Csub="LIN"/>
      <require Cclass="Device" Cgroup="SDK" Csub="PORT"/>
      <require Cclass="Device" Cgroup="SDK" Csub="PMU"/>
      <require Dvendor="Infineon:7" Dname="TLE987*QX*"/>
	  <require Tcompiler="ARMCC"/>
	  <accept Cclass="Device" Cgroup="ConfigWizard" Csub=""/>
	  <accept Cclass="Device" Cgroup="ConfigWizard_v2" Csub=""/>
    </condition>
<!--
	<condition id="TLE987x">
      <description>Infineon TLE987x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE987*QX*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
-->
	<condition id="TLE987x no -2QXA40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE987x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE987?QX*"/> <!-- "?" is the Wild-card for a single character; this excludes TLE9879-2QXA40 -->
      <require Tcompiler="ARMCC"/>
    </condition>

	<condition id="TLE987x_20">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE987x 24MHz device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE987*QX*20"/>
      <require Tcompiler="ARMCC"/>
    </condition>

	<condition id="TLE987x_40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE987x 40MHz device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE987*QX*40"/> <!-- TLE9879-2QXA40 is included -->
      <require Tcompiler="ARMCC"/>
    </condition>
	
	<condition id="TLE987x_40 no -2QXA40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE987x 40MHz device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE987?QX*40"/> <!-- "?" is the Wild-card for a single character; this excludes TLE9879-2QXA40 -->
      <require Tcompiler="ARMCC"/>
    </condition>

	<condition id="TLE9879_2QXA40">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9879-2QXA40 device</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9879-2QXA40"/>
      <require Tcompiler="ARMCC"/>
    </condition>

	<condition id="TLE9879_2QXA40_ADC34">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE9879-2QXA40 device</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
	  <require condition="TLE9879_2QXA40"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
      <require Dvendor="Infineon:7" Dname="TLE9879-2QXA40"/>
      <require Tcompiler="ARMCC"/>
    </condition>

	<condition id="TLE987x_BF">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE987x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE987?QXA*"/> <!-- "?" is the Wild-card for a single character; this excludes TLE9879-2QXA40 -->
      <require Tcompiler="ARMCC"/>
    </condition>
	
	<!--<condition id="TLE9871_BF">
      <description>Infineon TLE987x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9871QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

	<condition id="TLE9877_BF">
      <description>Infineon TLE987x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9877QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

	<condition id="TLE9879_BF">
      <description>Infineon TLE987x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9879QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>-->
	
