Infineon/cmsis_packs/TLE987x/Infineon.TLE987x_DFP.pdsc
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/pmu_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/pmu_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/adc1_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/adc1_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/> 
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/adc2_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/adc2_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/bdrv_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/bdrv_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/csa_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/csa_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/gpt12e_defines.h" 		attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/gpt12e_defines.h" 		attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/int_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/int_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/mon_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/mon_defines.h"			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/port_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/port_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/timer3_defines.h" 		attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/timer3_defines.h" 		attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/dma_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/dma_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
	 </files>
    </component>
	
	<component Cclass="Device" Cgroup="ConfigWizard_v2" Cversion="2.1.12" condition="Only ConfigWizard_v2">  <!-- Cversion is necessary -->
	 <description>Infineon ConfigWizard Configuration File</description>
	 <RTE_Components_h>
          #define CONFIGWIZARD 2
     </RTE_Components_h>
	 <files>
		<file category="doc" name="Device/SDK/cfgwiz/TLE987x_20/v2/config.icwp"              	attr="config" condition="TLE987x_20"     		version="1.8.6"/>
        <file category="doc" name="Device/SDK/cfgwiz/TLE987x_40/v2/config.icwp"              	attr="config" condition="TLE987x_40 no -2QXA40" version="1.8.6"/>
		<file category="doc" name="Device/SDK/cfgwiz/TLE9879_2/v2/config.icwp"               	attr="config" condition="TLE9879_2QXA40" 		version="1.8.6"/>
		
		<file category="doc" 	name="SVD/TLE987x.svd" 											attr="config" condition="TLE987x no -2QXA40" 	version="3.5.0"/>
		<file category="doc" 	name="SVD/TLE9879_2/TLE987x.svd" 								attr="config" condition="TLE9879_2QXA40" 		version="3.6.0"/>
		<file category="doc"    name="Device/SDK/cfgwiz/script/v2/ICW_TLE987x.xml"           	attr="config" condition="TLE987x no -2QXA40"    version="2.0.2"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/v2/TLE987x.mig"           		attr="config" condition="TLE987x no -2QXA40"    version="2.0.2"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/TLE9879_2/v2/ICW_TLE987x.xml" 	attr="config" condition="TLE9879_2QXA40" 		version="2.0.2"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/TLE9879_2/v2/TLE987x.mig" 		attr="config" condition="TLE9879_2QXA40" 		version="2.0.2"/>
		
		<!-- sdadc_defines.h only for TLE9879_2 -->
		<file category="header" name="Device/SDK/cfgwiz/TLE9879_2/v2/sdadc_defines.h" 				attr="config" condition="TLE9879_2QXA40" 		version="1.8.6"/>
		
		<!-- _defines.h which contens are the same between both versions of the Config Wizard -->	
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/ccu6_defines.h" 				attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/ccu6_defines.h" 				attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/isr_defines.h" 				attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/isr_defines.h" 				attr="config" condition="TLE987x_40 no -2QXA40" version="1.8.6"/> 
		<file category="header" name="Device/SDK/cfgwiz/TLE9879_2/v2/isr_defines.h" 				attr="config" condition="TLE9879_2QXA40" 		version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/lin_defines.h" 				attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/lin_defines.h" 				attr="config" condition="TLE987x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/ssc_defines.h" 				attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/ssc_defines.h" 				attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
