Infineon/cmsis_packs/TLE987x/Infineon.TLE987x_DFP.pdsc
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/timer2x_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/timer2x_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/uart_defines.h" 				attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/uart_defines.h" 				attr="config" condition="TLE987x_40" 			version="1.8.6"/> 
		
		<!-- _defines.h for which you have to differentiate between both versions of the Config Wizard -->		
		<file category="header"  name="Device/SDK/cfgwiz/TLE987x_20/v2/bsl_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8"/>
        <file category="header"  name="Device/SDK/cfgwiz/TLE987x_40/v2/bsl_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/scu_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/scu_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/pmu_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/pmu_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/adc1_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/adc1_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/adc2_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/adc2_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/bdrv_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/bdrv_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/csa_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/csa_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/gpt12e_defines.h" 		attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/gpt12e_defines.h" 		attr="config" condition="TLE987x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/int_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/int_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/> 

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/mon_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/mon_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/port_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/port_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/timer3_defines.h" 		attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/timer3_defines.h" 		attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/dma_defines.h" 			attr="config" condition="TLE987x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/dma_defines.h" 			attr="config" condition="TLE987x_40" 			version="1.8.6"/>
		
        <file category="doc"    name="Device/SDK/cfgwiz/script/v2/ICW_TLE987x.xml"           	attr="config" condition="TLE987x no -2QXA40"    version="2.0.1"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/v2/TLE987x.mig"           		attr="config" condition="TLE987x no -2QXA40"    version="2.0.1"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/TLE9879_2/v2/ICW_TLE987x.xml" 	attr="config" condition="TLE9879_2QXA40" 		version="2.0.2"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/TLE9879_2/v2/TLE987x.mig" 		attr="config" condition="TLE9879_2QXA40" 		version="2.0.2"/>
	 </files>
    </component>

    <component Cclass="Device" Cgroup="BF-Stepping" Cversion="0.0.1" condition="TLE987x_BF">
      <description>Select if target device is BF-Stepping</description>
      <RTE_Components_h>
        #define RTE_DEVICE_BF_STEP
      </RTE_Components_h>
      <files>
        <file category="doc" name="Documents/bf_stepping.html"/>
      </files>
    </component>
	
	<!--
    <component Cclass="Device" Cgroup="BF-Stepping" Cversion="0.0.1" condition="TLE987x_BF">
      <description>Select if target device is BF-Stepping</description>
      <RTE_Components_h>
        #define RTE_DEVICE_BF_STEP
      </RTE_Components_h>
      <files>
        <file category="doc" name="Documents/bf_stepping.html"/>
      </files>	  
    </component>

    <component Cclass="Device" Cgroup="BF-Stepping" Cversion="0.0.1" condition="TLE987x_BF">
      <description>Select if target device is BF-Stepping</description>
      <RTE_Components_h>
        #define RTE_DEVICE_BF_STEP
      </RTE_Components_h>
      <files>
        <file category="doc" name="Documents/bf_stepping.html"/>
      </files>	  
    </component>
	-->
	
    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.3.6" condition="TLE987x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SCU
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/scu.h"   attr="config"     version="0.3.6"/>
        <file category="source" name="Device/SDK/src/scu.c"   attr="config"     version="0.3.6"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" Cversion="0.2.4" condition="TLE987x CMSIS Device">
      <description>BootROM driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_BROM
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/bootrom.h" version="0.2.4"/>
        <file category="source" attr="config" name="Device/SDK/src/bootrom.c" version="0.2.4"/>
      </files>
    </component>

