Infineon/cmsis_packs/TLE987x/Infineon.TLE987x_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK" Csub="WDT1" Cversion="0.2.8" condition="TLE987x CMSIS Device">
      <description>Watchdog 1 (WDT1) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_WDT1
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/wdt1.h" version="0.2.8"/>
        <file category="source" attr="config" name="Device/SDK/src/wdt1.c" version="0.2.8"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PMU" Cversion="0.1.7" condition="TLE987x CMSIS Device">
      <description>Power Management Unit (SCU) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PMU
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/pmu.h"    attr="config"    version="0.1.7"/>
        <file category="source" name="Device/SDK/src/pmu.c"    attr="config"    version="0.1.7"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC1" Cversion="0.2.4" condition="ADC">
      <description>Analog Digital Converter 1 (ADC1) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC1
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/adc1.h"    attr="config"    version="0.2.4"/>
        <file category="source" name="Device/SDK/src/adc1.c"    attr="config"    version="0.2.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC2" Cversion="0.1.9" condition="ADC">
      <description>Analog Digital Converter 2 (ADC2) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC2
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/adc2.h"    attr="config"    version="0.1.9"/>
        <file category="source" name="Device/SDK/src/adc2.c"    attr="config"    version="0.1.9"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SDADC" Cversion="0.1.2" condition="TLE9879_2QXA40_ADC34">
      <description>Sigma Delta ADC driver for TLE9879-2QXA40</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC34
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/sdadc.h"   attr="config" version="0.1.2"/>
        <file category="source" name="Device/SDK/src/sdadc.c"   attr="config" version="0.1.2"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BDRV" Cversion="0.4.3" condition="TLE987x CMSIS Device">
      <description>Bridge Driver (BDRV) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_BDRV
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/bdrv.h"    attr="config"    version="0.4.3"/>
        <file category="source" name="Device/SDK/src/bdrv.c"    attr="config"    version="0.4.3"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CCU6" Cversion="0.2.7" condition="TLE987x CMSIS Device">
      <description>Capture Compare Unit (CCU6) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_CCU6
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/ccu6.h"    attr="config"    version="0.2.7"/>
        <file category="source" name="Device/SDK/src/ccu6.c"    attr="config"    version="0.2.7"/>
  	  </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CSA" Cversion="0.1.4" condition="ADC">
      <description>Current Sense Amplifier (CSA) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_CSA
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/csa.h"    attr="config"     version="0.1.4"/>
        <file category="source" name="Device/SDK/src/csa.c"    attr="config"     version="0.1.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" Cversion="0.1.8" condition="TLE987x CMSIS Device">
      <description>General Purpose Timer 12E (GPT12E) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_GPT12E
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/gpt12e.h"   attr="config"   version="0.1.8"/>
        <file category="source" name="Device/SDK/src/gpt12e.c"   attr="config"   version="0.1.8"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="INT" Cversion="0.1.8" condition="TLE987x CMSIS Device">
      <description>Interrupt (INT) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_INT
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/int.h"    attr="config"     version="0.1.8"/>
        <file category="source" name="Device/SDK/src/int.c"    attr="config"     version="0.1.8"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ISR" Cversion="0.2.4" condition="TLE987x CMSIS Device">
      <description>Interrupt Service Routines (ISR) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ISR
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/isr.h"    attr="config"    version="0.2.4"/>
        <file category="source" name="Device/SDK/src/isr.c"    attr="config"    version="0.2.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="LIN" Cversion="0.1.7" condition="TLE987x CMSIS Device">
      <description>LIN Tranceiver (LIN) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_LIN
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/lin.h"   attr="config"   version="0.1.7"/>
        <file category="source" name="Device/SDK/src/lin.c"   attr="config"   version="0.1.7"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="MON" Cversion="0.1.4" condition="TLE987x CMSIS Device">
      <description>High Voltage Monitor Input (MON) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_MON
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/mon.h"   attr="config"     version="0.1.4"/>
        <file category="source" name="Device/SDK/src/mon.c"   attr="config"     version="0.1.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PORT" Cversion="0.5.5" condition="TLE987x CMSIS Device">
      <description>GPIO Ports (PORT) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PORT
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/port.h"  attr="config"     version="0.5.5"/>
        <file category="source" name="Device/SDK/src/port.c"  attr="config"     version="0.5.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SSC" Cversion="0.1.5" condition="TLE987x CMSIS Device">
      <description>High Speed Synchronous Serial Interface 1 and 2 (SSC) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SSC
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/ssc.h"    attr="config"   version="0.1.5"/>
        <file category="source" name="Device/SDK/src/ssc.c"    attr="config"   version="0.1.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" Cversion="0.1.7" condition="TLE987x CMSIS Device">
      <description>Timer2 and Timer21 (TIMER2x) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_TIMER2X
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/timer2x.h"    attr="config"    version="0.1.7"/>
        <file category="source" name="Device/SDK/src/timer2x.c"    attr="config"    version="0.1.7"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="TIMER3" Cversion="0.1.5" condition="TLE987x CMSIS Device">
      <description>Timer3 (TIMER3) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_TIMER3
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/timer3.h"    attr="config"    version="0.1.5"/>
        <file category="source" name="Device/SDK/src/timer3.c"    attr="config"    version="0.1.5"/>
  	  </files>
    </component>
	
    <component Cclass="Device" Cgroup="SDK" Csub="UART" Cversion="0.1.8" condition="TLE987x CMSIS Device">
      <description>UART1 and UART2 (UART) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_UART
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/uart.h"    attr="config"     version="0.1.8"/>
        <file category="source" name="Device/SDK/src/uart.c"    attr="config"     version="0.1.8"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="SDK" Csub="DMA" Cversion="0.1.6" condition="TLE987x CMSIS Device">
      <description>DMA driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_DMA
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/dma.h"    attr="config"    version="0.1.6"/>
        <file category="source" name="Device/SDK/src/dma.c"    attr="config"    version="0.1.6"/>
      </files>
    </component>
  </components>
  
  <examples>
    <!--example name="SDK" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/SDK_EXAMPLE_TLE987X/">
      <description>Software Developer Kit</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SDK.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ADC2"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="MON"/>
		<component Cclass="Device" Cgroup="SDK" Csub="CSA"/>
		<component Cclass="Device" Cgroup="SDK" Csub="TIMER2x"/>
		<component Cclass="Device" Cgroup="SDK" Csub="TIMER3"/>
		<component Cclass="Device" Cgroup="SDK" Csub="GPT12E"/>
		<component Cclass="Device" Cgroup="SDK" Csub="CCU6"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BDRV"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SSC"/>
		<component Cclass="Device" Cgroup="SDK" Csub="UART"/>
		<component Cclass="Device" Cgroup="SDK" Csub="LIN"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>-->

    <example name="PMU Power Saving SleepMode" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/PMU_POWER_SAVING_SLEEP_MODE_EXAMPLE_TLE987X/">
      <description>Power Saving Modes - Sleep Mode</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_PowerSaving_SleepMode.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="Blinky Running Lights" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/BLINKY_RUNNING_LIGHTS_EXAMPLE_TLE987X/">
      <description>Blinky - Running Lights</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="BLINKY_RunningLights.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="CCU6"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/BLINKY_EXAMPLE_TLE987X/">
      <description>Blinky - blinks LED1</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>

    <example name="PMU Power Saving StopMode" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/PMU_POWER_SAVING_STOP_MODE_EXAMPLE_TLE987X/">
      <description>Power Saving Modes - Stop Mode</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_PowerSaving_StopMode.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
	<example name="PMU Power Saving SleepMode CyclicWake" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/PMU_POWER_SAVING_SLEEP_MODE_CYCLIC_WAKE_EXAMPLE_TLE987X/">
      <description>Power Saving Modes - Sleep Mode with cyclic wake</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_PowerSaving_SleepMode_CyclicWake.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="MON"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
	<example name="PMU Reset Status" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/PMU_RESET_STATUS_EXAMPLE_TLE987X/">
      <description>Reset Status Evaluation</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_ResetStatus.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="MON"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
	<example name="PMU VDDEXT" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/PMU_VDDEXT_EXAMPLE_TLE987X/">
      <description>VDDEXT handling</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="PMU_VDDEXT.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PMU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
	<example name="SCU PLL adjustment" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/SCU_PLL_EXAMPLE_TLE987X/">
      <description>PLL adjustment</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SCU_PLL.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ADC1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ADC2"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BDRV"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
	<example name="SCU PLL with XTAL" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/SCU_PLL_XTAL_EXAMPLE_TLE987X/">
      <description>PLL with external XTAL</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SCU_PLL_XTAL.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
	<example name="NVM Programming" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/NVM_PROG_EXAMPLE_TLE987X/">
      <description>NVM Page Programming</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="NVM_PROG.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
	<example name="NVM Programming with RAM branch" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/NVM_RAM_BRANCH_EXAMPLE_TLE987X/">
      <description>NVM Programming with RAM Branch</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="NVM_RAM_BRANCH.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
	<example name="NVM Protection" doc="Abstract.txt" folder="Boards/Infineon/TLE9879_EvalKit/NVM_PROTECTION_EXAMPLE_TLE987X/">
      <description>Flash Page Write Protection</description>
      <board name="TLE9879 EvalKit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="NVM_PROTECTION.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
		<component Cclass="Device" Cgroup="SDK" Csub="SCU"/>
		<component Cclass="Device" Cgroup="SDK" Csub="ISR"/>
		<component Cclass="Device" Cgroup="SDK" Csub="INT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
		<component Cclass="Device" Cgroup="SDK" Csub="PORT"/>
		<component Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
        <category>Getting Started</category>
        <category>SDK</category>
      </attributes>
    </example>
	
